app/Controllers/Api/Kedua.php

    public function show($id = null)
    {
        $model = new TransferModel();

        // Ambil 3 transaksi terakhir dalam satu query saja
        $transaksi = $model
            ->where("nisn", $id)
            ->orderBy("tanggal", "desc")
            ->limit(3)
            ->findAll();
---
SELECT *
FROM `transfer`
WHERE `nisn` = 'FATAH2601'
ORDER BY `tanggal` DESC