app/Controllers/Home.php

SELECT *
FROM `santri`
WHERE `program` = 'mandiri'
---
    public function beranda()
    {
        $sumTransaksi = new TransferModel();
        $sumTunggakan = new SantriModel();
        $psbmodel = new PsbModel();
        $detailmodel = new DetailModel();

        $resultung = $sumTunggakan;
        $resulSum = $sumTransaksi;
        $psb = $psbmodel;
        $detail = $detailmodel;

        $temptung = $sumTunggakan->where("program", "mandiri")->findAll();

SELECT *, count(status) as jumlah, sum(tunggakandu) as totaltunggakan, sum(daftarulang) as kewajiban, (sum(daftarulang) - sum(tunggakandu)) as pembayaran
FROM `psb`
GROUP BY `status`
---
                )
                ->where("program", "beasiswa")
                ->findAll(),
            "psb" => $psb
                ->select(
                    "*, count(status) as jumlah, sum(tunggakandu) as totaltunggakan, sum(daftarulang) as kewajiban, (sum(daftarulang) - sum(tunggakandu)) as pembayaran"
                )
                ->groupBy("status")
                ->findAll(),