app/Controllers/Page.php

SELECT *
FROM `transfer`
WHERE `transfer`.`idtrans` = '4536'
SELECT *
FROM `detail`
WHERE `detail`.`id` = '4536'
SELECT *
FROM `psb`
WHERE `nisn` = 'FATAH2601'
 LIMIT 1
---
  public function kwitansi_santri_psb($idtrans)
    {
        $transferModel = new TransferModel();
        $detailModel   = new DetailModel();
        $santriModel   = new PsbModel();

        // Data utama transaksi
        $transfer = $transferModel->find($idtrans);
        if (!$transfer) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound("Transaksi dengan ID $idtrans tidak ditemukan");
        }

        // Data detail transaksi
        $detail = $detailModel->find($idtrans);

        // Data santri berdasarkan NISN dari transfer
        $santri = null;
        if ($transfer['nisn']) {
            $santri = $santriModel->where('nisn', $transfer['nisn'])->first();