app/Controllers/Psb.php

SELECT *
FROM `psb`
WHERE `status` = 'formulir'
ORDER BY `tanggal` DESC
---
public function filter()
{
    if ($this->request->isAJAX()) {
        $status = $this->request->getJSON()->status ?? null;

        $psbmodel = new PsbModel();
        $builder = $psbmodel->orderBy('tanggal', 'DESC');

        if ($status) $builder->where('status', $status);

        $data['result'] = $builder->findAll();

INSERT INTO `transfer` (`idtrans`, `nisn`, `nama`, `program`, `kelas`, `saldomasuk`, `tanggal`, `keterangan`, `rekening`) VALUES ('4536', 'FATAH2601', 'MUHAMMAD ABDUL FATAH', 'PSB', '7', '7000000', '2026-01-11', 'Angsuran Daftar Ulang', 'Jatim Syariah')
INSERT INTO `detail` (`id`, `program`, `tanggal`, `rekening`, `daftarulang`, `spp`, `uangsaku`, `infaq`, `formulir`) VALUES ('4536', 'PSB', '2026-01-11', 'Jatim Syariah', 7000000, 0, 0, 0, 0)
---
public function bayar()
{
    if (!$this->validate([
        'nisn' => 'required',
        'tdu'  => 'required|numeric'
    ])) {
        return redirect()->to('/pembayaran-psb')
            ->withInput()
            ->with('error', 'Data tidak lengkap');
    }

    $transfer = new TransferModel();
    $detail   = new DetailModel();
    $psb      = new PsbModel();

    $id    = $this->request->getPost('id');
    $nisn  = $this->request->getPost('nisn');
    $tdu   = (int) $this->request->getPost('tdu');
    $infaq = (int) $this->request->getPost('infaq');

    /* ================= SIMPAN TRANSFER ================= */
    $transfer->insert([
        'idtrans'     => $id,
        'nisn'        => $nisn,
        'nama'        => $this->request->getPost('nama'),
        'program'     => 'PSB',
        'kelas'       => $this->request->getPost('kelas'),
        'saldomasuk'  => $this->request->getPost('saldomasuk'),
        'tanggal'     => $this->request->getPost('tanggal'),
        'keterangan'  => $this->request->getPost('keterangan'),
        'rekening'    => $this->request->getPost('rekening'),
    ]);

    /* ================= SIMPAN DETAIL ================= */
    $detail->insert([
        'id'          => $id,
        'program'     => 'PSB',
        'tanggal'     => $this->request->getPost('tanggal'),
        'rekening'    => $this->request->getPost('rekening'),
        'daftarulang' => $tdu,
        'spp'         => 0,
        'uangsaku'    => 0,
        'infaq'       => $infaq,
        'formulir'    => 0
    ]);

UPDATE `psb` SET `tunggakandu` = 7000000
WHERE `psb`.`id` IN ('4534')
---

    if ($psbData) {
        $sisa = max(0, $psbData['tunggakandu'] - $tdu);
        $psb->update($psbData['id'], ['tunggakandu' => $sisa]);