app/Controllers/Santri.php

public function psb()
{
  $dataPsb = new PsbModel();

  // Hitung Total per Jenjang
  $totalb = (clone $dataPsb)->where('status', 'diterima')->countAllResults();
  $mts    = (clone $dataPsb)->where(['jenjang' => 'mts', 'status' => 'diterima'])->countAllResults();
  $ma     = (clone $dataPsb)->where(['jenjang' => 'ma', 'status' => 'diterima'])->countAllResults();
  $statusList = (clone $dataPsb)->select('status')->groupBy('status')->findAll();

  // Jenjang & Kelas per Jenjang
  $jenjangList = (clone $dataPsb)->select('jenjang')->groupBy('jenjang')->findAll();
  $kelasByJenjang = [];
  foreach ($jenjangList as $j) {
    $kelas = (clone $dataPsb)
      ->select('kelas')
      ->where('jenjang', $j['jenjang'])
      ->groupBy('kelas')
      ->orderBy('kelas')
      ->findAll();
---
SELECT COUNT(*) AS `numrows`
FROM `psb`
WHERE `status` = 'diterima'
SELECT COUNT(*) AS `numrows`
FROM `psb`
WHERE `jenjang` = 'mts'
AND `status` = 'diterima'
SELECT COUNT(*) AS `numrows`
FROM `psb`
WHERE `jenjang` = 'ma'
AND `status` = 'diterima'
SELECT `status`
FROM `psb`
GROUP BY `status`
SELECT `jenjang`
FROM `psb`
GROUP BY `jenjang`
SELECT `kelas`
FROM `psb`
WHERE `jenjang` = 'MA'
GROUP BY `kelas`
ORDER BY `kelas`